In [6]:
from __future__ import division
import os,sys

import numpy as np
import pandas as pd
from pandas import Series,DataFrame

br='\n'

%matplotlib inline
import matplotlib.pyplot as plt

In [2]:
import platform
system=platform.system()
print(system,br)

if system =='Windows':
    !type data6\ex1.csv
elif system =='Linux':
    !cat data6/ex1.csv

Windows

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('data6/ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_table('data6/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
!type data6\ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [11]:
result = pd.read_table('data6/ex3.txt',sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [13]:
!type data6\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [14]:
pd.read_csv('data6/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [15]:
pd.read_csv('data6/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [16]:
pd.read_csv('data6/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
pd.read_csv('data6/ex2.csv',names=['第一季度','第二季度','第三季度','第四季度','合计'])

   第一季度  第二季度  第三季度  第四季度     合计
0     1     2     3     4  hello
1     5     6     7     8  world
2     9    10    11    12    foo

In [18]:
names=['a','b','c','d','message']
pd.read_csv('data6/ex2.csv',names=names,index_col=[4])

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [19]:
names=['a','b','c','d','message']
pd.read_csv('data6/ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [20]:
!type data6\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [21]:
parsed=pd.read_csv('data6/csv_mindex.csv',index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
#pd.read_csv?

In [23]:
!type data6\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo
# this is footer lines?
# thanks god

In [24]:
pd.read_csv('data6/ex4.csv',skiprows=[0,2,3],skipfooter=2,index_col='message',engine='python')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [25]:
pd.read_csv('data6/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo
# this is footer lines?                            NaN      NaN NaN      NaN
# thanks god                                       NaN      NaN NaN      NaN

In [26]:
!type data6\ex5.csv
result =pd.read_csv('data6/ex5.csv')
pd.isnull(result)

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [28]:
result =pd.read_csv('data6/ex5.csv',na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
sentinels={'message':['foo','NULL'],'something':['two']}
pd.read_csv('data6/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [31]:
import pandas as pd 
import numpy as np
from pandas import Series,DataFrame

result=pd.read_csv('data6/ex6.csv')
print(len(result))
result.head()

10000

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [32]:
pd.read_csv('data6/ex6.csv',nrows=3)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G

In [33]:
chunker =pd.read_csv('data6/ex6.csv',chunksize=1000)
chunker

In [34]:
tot=Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
tot=tot.sort_values(ascending=False)
tot[:5]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
dtype: float64

In [35]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [36]:
!type data6\ex5.csv
data=pd.read_csv('data6/ex5.csv')

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [37]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
df=data.to_csv('data6/out-ex501.csv')

In [39]:
!type data6\out-ex501.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [41]:
data.to_csv('data6/out-ex5-sepbar01.csv',sep='|')
!type data6\out-ex5-sepbar01.csv

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [42]:
import os,sys
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [44]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [45]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [46]:
data.to_csv(sys.stdout,index=False,columns=['a','c','b'])

a,c,b
1,3.0,2
5,,6
9,11.0,10

In [47]:
dates=pd.date_range('3/22/2017',periods=5)
ts=Series(np.arange(5.0),index=dates)
ts.to_csv('data6/tseries.csv')
!type data6\tseries.csv

2017-03-22,0.0
2017-03-23,1.0
2017-03-24,2.0
2017-03-25,3.0
2017-03-26,4.0

In [48]:
Series.from_csv('data6/tseries.csv',parse_dates=True)

F:\Anaconda\anaconda3\lib\site-packages\pandas\core\series.py:3727: FutureWarning: from_csv is deprecated. Please use read_csv(...) instead. Note that some of the default arguments are different, so please refer to the documentation for from_csv when changing your function calls
  infer_datetime_format=infer_datetime_format)

2017-03-22    0.0
2017-03-23    1.0
2017-03-24    2.0
2017-03-25    3.0
2017-03-26    4.0
dtype: float64

In [ ]:
#手工处理分隔符格式

In [49]:
!type data6\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [50]:
import csv

In [52]:
f=open('data6/ex7.csv')
reader=csv.reader(f)
reader

In [53]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [54]:
lines=list(csv.reader(open('data6/ex7.csv')))

header,values=lines[0],lines[1:]
data_dict={h:v for h,v in zip(header,list(zip(*values)))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [55]:
xls_file=pd.ExcelFile('data6/address.xls',encoding='GBK')

table=xls_file.parse('Sheet1')
table.head()

   区镇道路   建筑名        组织机构
0   萧山区  明怡花苑    浙江旅游职业学院
1   杭州市  心意广场  浙江建设职业技术学院
2   浙江省  佳丰北苑  浙江同济科技职业学院
3   宁围镇  宁安社区  浙江师范大学萧山校区
4  北干街道  湘湖家园     戈雅公寓夏风园

In [57]:
xls_pub=pd.ExcelFile('data6/Pub.xls')
tb1=xls_pub.parse('Author')
tb1.tail()

,Id,Name,Affiliation
49,1718061,Michael P Muehlenbein,"Reproductive Ecology Laboratory, Department of..."
50,436474,Benjamin C Campbell,"Department of Anthropology, Boston University,..."
51,578318,Kathrine M Phillippi-Falkenstein,"Department of Veterinary Medicine, Tulane Nati..."
52,596633,Robert J Richards,NaN
53,784458,Frank Svec,NaN

In [58]:
xls_pub =pd.ExcelFile('data6/Pub.xls')
tb2=xls_pub.parse('Paper')
tb2.head()

,Id,Title,Year,ConferenceId,JournalId,Keyword
0,1,Hypermethylation of the <I>TPEF/HPP1</I> Gene ...,2005,0,3943,"Keywords: methylation, epigenetic, metastasis,..."
1,9,A Formal Approach to Service Component Archite...,2006,2397,0,NaN
2,3,Skew-Circulant Preconditioners for Systems of ...,2000,1389,0,NaN
3,11,A Framework for the Parallel Processing of Dat...,1990,0,253,NaN
4,5,Newer approaches to the diagnosis of early ons...,2006,0,2620,NaN

In [59]:
xls_pub=pd.ExcelFile('data6/Pub.xls')
tb3=xls_pub.parse('Sheet3')
tb3.head()

   PaperId  AuthorId                  Name Affiliation
0        1   1140870  Matthias P. A. Ebert         NaN
1        1    187581     Suzanne H. Mooney         NaN
2        1    229514      Christoph Ricken         NaN
3        1    245283              Jie Chen         NaN
4        1    275681   Hans-Ulrich Schulzb         NaN

In [61]:
PAfull=pd.merge(tb3,tb2,left_on='PaperId',right_on='Id')
PAfull[:2]

,PaperId,AuthorId,Name,Affiliation,Id,Title,Year,ConferenceId,JournalId,Keyword
0,1,1140870,Matthias P. A. Ebert,NaN,1,Hypermethylation of the <I>TPEF/HPP1</I> Gene ...,2005,0,3943,"Keywords: methylation, epigenetic, metastasis,..."
1,1,187581,Suzanne H. Mooney,NaN,1,Hypermethylation of the <I>TPEF/HPP1</I> Gene ...,2005,0,3943,"Keywords: methylation, epigenetic, metastasis,..."

In [62]:
import json

In [70]:
json_string='{"name":"USA","state":[{"nm":"Washington","cities":[{"city":["S","O"]}]},{"nm":"Calif","cities":[{"city":["A","B"]}]}]}'

In [71]:
result=json.loads(json_string)
result

{'name': 'USA',
 'state': [{'cities': [{'city': ['S', 'O']}], 'nm': 'Washington'},
  {'cities': [{'city': ['A', 'B']}], 'nm': 'Calif'}]}

In [72]:
asjson=json.dumps(result)
print(asjson)

{"state": [{"cities": [{"city": ["S", "O"]}], "nm": "Washington"}, {"cities": [{"city": ["A", "B"]}], "nm": "Calif"}], "name": "USA"}

In [73]:
cities=DataFrame(result['state'],columns=['cities'])
cities

                   cities
0  [{'city': ['S', 'O']}]
1  [{'city': ['A', 'B']}]

In [74]:
tweets=pd.read_json(open('data6/tweets.json'))
print(len(tweets))

tweets[:2]

281

,annotation,contributors,coordinates,created_at,entities,event_description,extended_entities,favorite_count,favorited,filter_level,...,retweeted,source,structure,support,text,thread_id,topic_news,truncated,tweet_type,user
0,NaN,NaN,None,2015-03-24 12:14:04,"{'symbols': [], 'hashtags': [{'indices': [0, 9...","Germanwings Flight, Germanwings crash",{'media': [{'sizes': {'thumb': {'resize': 'cro...,0,False,NaN,...,False,"<a href=""http://twitter.com/download/iphone"" r...",NaN,comment,#Breaking RT @NBCNews: #Germanwings passenger ...,580339825649291264,germanwings-crash,False,direct-reply,"{'profile_background_tile': True, 'time_zone':..."
1,NaN,NaN,None,2015-03-24 11:43:13,"{'symbols': [], 'hashtags': [], 'user_mentions...","Germanwings Flight, Germanwings crash",NaN,1,False,NaN,...,False,"<a href=""http://twitter.com"" rel=""nofollow"">Tw...",NaN,comment,@cobaltjacket @thatjohn @RunwayGirl Lots of ra...,580331561398108160,germanwings-crash,False,deep-reply,"{'profile_background_tile': False, 'time_zone'..."

In [75]:
import json 
with open('data6/tweets.json') as json_file:
    tweets=json.load(json_file)
len(tweets)

281

In [76]:
print(len(tweets[0]))
tweets[0]

32

{'contributors': None,
 'coordinates': None,
 'created_at': 'Tue Mar 24 12:14:04 +0000 2015',
 'entities': {'hashtags': [{'indices': [0, 9], 'text': 'Breaking'},
   {'indices': [23, 35], 'text': 'Germanwings'}],
  'media': [{'display_url': 'pic.twitter.com/sms8KtXxgX',
    'expanded_url': 'http://twitter.com/NBCNews/status/580339825649291264/photo/1',
    'id': 580339825473122304,
    'id_str': '580339825473122304',
    'indices': [115, 137],
    'media_url': 'http://pbs.twimg.com/media/CA3H_xpWcAAjs6D.jpg',
    'media_url_https': 'https://pbs.twimg.com/media/CA3H_xpWcAAjs6D.jpg',
    'sizes': {'large': {'h': 320, 'resize': 'fit', 'w': 560},
     'medium': {'h': 320, 'resize': 'fit', 'w': 560},
     'small': {'h': 194, 'resize': 'fit', 'w': 340},
     'thumb': {'h': 150, 'resize': 'crop', 'w': 150}},
    'source_status_id': 580339825649291264,
    'source_status_id_str': '580339825649291264',
    'source_user_id': 14173315,
    'source_user_id_str': '14173315',
    'type': 'photo',
    'url': 'http://t.co/sms8KtXxgX'}],
  'symbols': [],
  'urls': [{'display_url': 'nbcnews.to/1Ovnq9L',
    'expanded_url': 'http://nbcnews.to/1Ovnq9L',
    'indices': [92, 114],
    'url': 'http://t.co/IKWmXRw9Sk'}],
  'user_mentions': [{'id': 14173315,
    'id_str': '14173315',
    'indices': [13, 21],
    'name': 'NBC News',
    'screen_name': 'NBCNews'}]},
 'event_description': 'Germanwings Flight, Germanwings crash',
 'extended_entities': {'media': [{'display_url': 'pic.twitter.com/sms8KtXxgX',
    'expanded_url': 'http://twitter.com/NBCNews/status/580339825649291264/photo/1',
    'id': 580339825473122304,
    'id_str': '580339825473122304',
    'indices': [115, 137],
    'media_url': 'http://pbs.twimg.com/media/CA3H_xpWcAAjs6D.jpg',
    'media_url_https': 'https://pbs.twimg.com/media/CA3H_xpWcAAjs6D.jpg',
    'sizes': {'large': {'h': 320, 'resize': 'fit', 'w': 560},
     'medium': {'h': 320, 'resize': 'fit', 'w': 560},
     'small': {'h': 194, 'resize': 'fit', 'w': 340},
     'thumb': {'h': 150, 'resize': 'crop', 'w': 150}},
    'source_status_id': 580339825649291264,
    'source_status_id_str': '580339825649291264',
    'source_user_id': 14173315,
    'source_user_id_str': '14173315',
    'type': 'photo',
    'url': 'http://t.co/sms8KtXxgX'}]},
 'favorite_count': 0,
 'favorited': False,
 'geo': None,
 'id': 580341810729369600,
 'id_str': '580341810729369600',
 'in_reply_to_screen_name': 'NBCNews',
 'in_reply_to_status_id': 580339825649291264,
 'in_reply_to_status_id_str': '580339825649291264',
 'in_reply_to_user_id': 14173315,
 'in_reply_to_user_id_str': '14173315',
 'lang': 'en',
 'place': None,
 'possibly_sensitive': False,
 'possibly_sensitive_appealable': False,
 'responsetype-vs-previous': 'comment',
 'responsetype-vs-source': 'comment',
 'retweet_count': 1,
 'retweeted': False,
 'source': '<a href="http://twitter.com/download/iphone" rel="nofollow">Twitter for iPhone</a>',
 'support': 'comment',
 'text': '#Breaking RT @NBCNews: #Germanwings passenger plane crashes in French Alps with 148 onboard http://t.co/IKWmXRw9Sk http://t.co/sms8KtXxgX',
 'thread_id': '580339825649291264',
 'topic_news': 'germanwings-crash',
 'truncated': False,
 'tweet_type': 'direct-reply',
 'user': {'contributors_enabled': False,
  'created_at': 'Tue Mar 13 15:09:11 +0000 2012',
  'default_profile': False,
  'default_profile_image': False,
  'description': 'Anchor/Reporter at KSEE 24...but first a mom and wife. Live for my #family, #running and the #Dodgers! Catch me weekdays on #KSEE Sunrise from 5am-7am!',
  'entities': {'description': {'urls': []},
   'url': {'urls': [{'display_url': 'facebook.com/carina.corralk…',
      'expanded_url': 'https://www.facebook.com/carina.corralksee',
      'indices': [0, 23],
      'url': 'https://t.co/oUy6CqIUHW'}]}},
  'favourites_count': 1235,
  'follow_request_sent': False,
  'followers_count': 1249,
  'following': False,
  'friends_count': 1017,
  'geo_enabled': True,
  'id': 523349706,
  'id_str': '523349706',
  'is_translation_enabled': False,
  'is_translator': False,
  'lang': 'en',
  'listed_count': 26,
  'location': 'Fresno, CA',
  'name': 'Carina Corral',
  'notifications': False,
  'profile_background_color': '131516',
  'profile_background_image_url': 'http://pbs.twimg.com/profile_background_images/879890622/5a19226ce8bc393aaf24a11bf23b4c68.jpeg',
  'profile_background_image_url_https': 'https://pbs.twimg.com/profile_background_images/879890622/5a19226ce8bc393aaf24a11bf23b4c68.jpeg',
  'profile_background_tile': True,
  'profile_banner_url': 'https://pbs.twimg.com/profile_banners/523349706/1423763011',
  'profile_image_url': 'http://pbs.twimg.com/profile_images/565929546730319872/ApqzIDQm_normal.png',
  'profile_image_url_https': 'https://pbs.twimg.com/profile_images/565929546730319872/ApqzIDQm_normal.png',
  'profile_link_color': '009999',
  'profile_location': None,
  'profile_sidebar_border_color': '000000',
  'profile_sidebar_fill_color': 'C0DFEC',
  'profile_text_color': '333333',
  'profile_use_background_image': True,
  'protected': False,
  'screen_name': 'CorralCarina',
  'statuses_count': 3472,
  'time_zone': 'Pacific Time (US & Canada)',
  'url': 'https://t.co/oUy6CqIUHW',
  'utc_offset': -25200,
  'verified': False}}

In [80]:
print(tweets[0]['id'])
print(tweets[0]['text'])
print(tweets[0]['retweet_count'])
print(tweets[0]['favorite_count'])
print(tweets[0]['user']['name'])
print(tweets[0]['user']['favourites_count'])
print(tweets[0]['user']['friends_count'])
print(tweets[0]['user']['followers_count'])

580341810729369600
#Breaking RT @NBCNews: #Germanwings passenger plane crashes in French Alps with 148 onboard http://t.co/IKWmXRw9Sk http://t.co/sms8KtXxgX
1
0
Carina Corral
1235
1017
1249

In [81]:
print(tweets[5]['id'])
print(tweets[5]['text'])
print(tweets[5]['retweet_count'])
print(tweets[5]['favorite_count'])
print(tweets[5]['user']['favourites_count'])
print(tweets[5]['user']['name'])
print(tweets[5]['user']['favourites_count'])
print(tweets[5]['user']['friends_count'])
print(tweets[5]['user']['followers_count'])

580331561398108160
1047 call: DGAC source says pilots called «urgence, urgence» (“emergency, emergency”), as opposed to a mayday call or 7700 squawk. #4U9525
111
14
1008
John Walton
1008
347
7038

In [83]:
import requests
url='http://search.twitter.com/search.json?q=trump'
resp=requests.get(url)

import json
data=json.loads(resp.text)
results=DataFrame(data)
results

ConnectionError: HTTPConnectionPool(host='search.twitter.com', port=80): Max retries exceeded with url: /search.json?q=trump (Caused by NewConnectionError('<urllib3.connection.HTTPConnection object at 0x000000D1538E0CF8>: Failed to establish a new connection: [WinError 10060] 由于连接方在一段时间后没有正确答复或连接的主机没有反应，连接尝试失败。',))

In [85]:
from lxml.html import parse
from urllib.request import urlopen

parsed =parse(urlopen('http://finance.yahoo.com/q/op?s=AAPL+Options'))
doc=parsed.getroot()

In [86]:
links=doc.findall('.//a')
links[15:20]

[<Element a at 0xd1539e4098>,
 <Element a at 0xd1539e40e8>,
 <Element a at 0xd1539e4138>,
 <Element a at 0xd1539e4188>,
 <Element a at 0xd1539e41d8>]

In [87]:
lnk=links[28]

In [88]:
lnk.get('href')

'/quote/AAPL/options?strike=false&straddle=false'

In [89]:
lnk.text_content()

'50.00'

In [90]:
urls=[lnk.get('href') for lnk in doc.findall('.//a')]
urls[-10:]

['http://facebook.com/yahoofinance',
 'http://yahoofinance.tumblr.com',
 '/',
 '/watchlists',
 '/portfolios',
 '/screener',
 '/calendar',
 '/industries',
 '/personal-finance',
 '/tech']

In [92]:
!type data6\xml-sample.xml

<note>
<to>George</to>
<from>John</from>
<heading>Reminder</heading>
<body>Don't forget the meeting!</body>
</note>

In [93]:
from lxml import etree

xml_file=etree.parse('data6/xml-sample.xml')

root_node=xml_file.getroot()

In [94]:
for sub_node in root_node:
    print(sub_node.tag,":",sub_node.text)

to : George
from : John
heading : Reminder
body : Don't forget the meeting!

In [96]:
df=pd.read_csv('data6/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [97]:
df.to_pickle('data6/ex1_pickle')

In [98]:
pd.read_pickle('data6/ex1_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [99]:
store =pd.HDFStore('data6/mydata.h5')
df=pd.read_csv('data6/ex1.csv')
store['obj1']=df
store['obj1_col']=df['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: data6/mydata.h5

In [100]:
store['obj1']

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [101]:
store['obj1_col']

0    1
1    5
2    9
Name: a, dtype: int64

In [102]:
store.close()
os.remove('data6/mydata.h5')

In [109]:
import sqlite3
query="""
CREATE TABLE test
(a VARCHAR(20),b VARCHAR(20),
c REAL,d INTEGER
);"""
con=sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [110]:
data=[('Atlanta','Georgia',1.25,6),
     ('Tallahassee','Florida',2.6,3),
     ('Sacramento','California',1.7,5)]
stmt="INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt,data)
con.commit()

In [111]:
cursor =con.execute('select * from test')
rows=cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [112]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [113]:
cursor.description[1][0]

'b'

In [114]:
DataFrame(rows,columns=list(zip(*cursor.description))[0])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [115]:
import pandas.io.sql as sql
sql.read_sql('select * from test',con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [1]:
from pymongo import MongoClient
client=MongoClient()

In [3]:
db=client['mydatabase']

In [4]:
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase')

In [ ]:
collection =d